This is a file to explore the data sets to:
- set goal of project 
- explore any issues with raw data 
- determine structure of data warehouse or data lake

In [55]:
import pandas as pd 
import numpy as np 
#import Disaster Data 1900 - 2021
pd_d = pd.read_csv('C:\\Users\\msbar\\Data Engineering Final Project\\data\\DISASTERS\\1900_2021_DISASTERS.csv')
pd_d.shape

(16126, 45)

In [56]:
pd_d.head()

,Year,Seq,Glide,Disaster Group,Disaster Subgroup,Disaster Type,Disaster Subtype,Disaster Subsubtype,Event Name,Country,...,No Affected,No Homeless,Total Affected,Insured Damages ('000 US$),Total Damages ('000 US$),CPI,Adm Level,Admin1 Code,Admin2 Code,Geo Locations
0,1900,9002,NaN,Natural,Climatological,Drought,Drought,NaN,NaN,Cabo Verde,...,NaN,NaN,NaN,NaN,NaN,3.221647,NaN,NaN,NaN,NaN
1,1900,9001,NaN,Natural,Climatological,Drought,Drought,NaN,NaN,India,...,NaN,NaN,NaN,NaN,NaN,3.221647,NaN,NaN,NaN,NaN
2,1902,12,NaN,Natural,Geophysical,Earthquake,Ground movement,NaN,NaN,Guatemala,...,NaN,NaN,NaN,NaN,25000.0,3.350513,NaN,NaN,NaN,NaN
3,1902,3,NaN,Natural,Geophysical,Volcanic activity,Ash fall,NaN,Santa Maria,Guatemala,...,NaN,NaN,NaN,NaN,NaN,3.350513,NaN,NaN,NaN,NaN
4,1902,10,NaN,Natural,Geophysical,Volcanic activity,Ash fall,NaN,Santa Maria,Guatemala,...,NaN,NaN,NaN,NaN,NaN,3.350513,NaN,NaN,NaN,NaN

In [57]:
 #Find percentage of column that is null 
    na = pd_d.isna().sum()
 print(na/pd_d.shape[0])

IndentationError: unexpected indent (<ipython-input-57-5c2fbd9f2c8b>, line 2)

In [58]:
pd_d['Disaster Type'].value_counts()

Flood                    5551
Storm                    4496
Earthquake               1544
Epidemic                 1501
Landslide                 776
Drought                   770
Extreme temperature       603
Wildfire                  471
Volcanic activity         265
Insect infestation         96
Mass movement (dry)        48
Glacial lake outburst       2
Fog                         1
Impact                      1
Animal accident             1
Name: Disaster Type, dtype: int64

In [59]:
# World Surface Temperature data by Country 
pd_temp = pd.read_csv('C:\\Users\\msbar\\Data Engineering Final Project\\data\\GlobalLandTemperaturesByCountry.csv')
pd_d3.shape

(577462, 4)

In [60]:
pd_temp.head()

           dt  AverageTemperature  AverageTemperatureUncertainty Country
0  1743-11-01               4.384                          2.294   Ã…land
1  1743-12-01                 NaN                            NaN   Ã…land
2  1744-01-01                 NaN                            NaN   Ã…land
3  1744-02-01                 NaN                            NaN   Ã…land
4  1744-03-01                 NaN                            NaN   Ã…land

In [61]:
pd_temp[pd_temp['dt'] > '1900-01-01']

,dt,AverageTemperature,AverageTemperatureUncertainty,Country
1875,1900-02-01,-8.063,0.657,Ã…land
1876,1900-03-01,-3.196,0.467,Ã…land
1877,1900-04-01,0.781,0.224,Ã…land
1878,1900-05-01,4.960,0.503,Ã…land
1879,1900-06-01,12.296,1.129,Ã…land
...,...,...,...,...
577457,2013-05-01,19.059,1.022,Zimbabwe
577458,2013-06-01,17.613,0.473,Zimbabwe
577459,2013-07-01,17.000,0.453,Zimbabwe
577460,2013-08-01,19.759,0.717,Zimbabwe
577461,2013-09-01,NaN,NaN,Zimbabwe

In [62]:
pd_temp.describe()

       AverageTemperature  AverageTemperatureUncertainty
count       544811.000000                  545550.000000
mean            17.193354                       1.019057
std             10.953966                       1.201930
min            -37.658000                       0.052000
25%             10.025000                       0.323000
50%             20.901000                       0.571000
75%             25.814000                       1.206000
max             38.842000                      15.003000

In [63]:
# World Population Data from 1960 by Country
pd_pop = pd.read_csv('C:\\Users\\msbar\\Data Engineering Final Project\\data\\Population\\population_total_long.csv')
pd_pop.shape

(12595, 3)

In [64]:
pd_pop.head()

  Country Name  Year    Count
0        Aruba  1960    54211
1  Afghanistan  1960  8996973
2       Angola  1960  5454933
3      Albania  1960  1608800
4      Andorra  1960    13411

In [70]:
pd_pop["Year"].min()

1960

In [65]:
pd_pop['Country Name'].value_counts()

Lesotho                      58
Paraguay                     58
Angola                       58
Rwanda                       58
Fiji                         58
                             ..
Kuwait                       55
Eritrea                      52
West Bank and Gaza           28
Serbia                       28
Sint Maarten (Dutch part)    20
Name: Country Name, Length: 219, dtype: int64

In [66]:
# CO2 Emission data 1751 - 2018 by Country
pd_em = pd.read_csv("C:\\Users\\msbar\\Data Engineering Final Project\\data\\co2_emission.csv")
pd_em.shape
list(pd_em.columns)

['Entity', 'Code', 'Year', 'Annual COâ‚‚ emissions (tonnes )']

In [67]:
pd_em.head()

        Entity Code  Year  Annual COâ‚‚ emissions (tonnes )
0  Afghanistan  AFG  1949                         14656.0
1  Afghanistan  AFG  1950                         84272.0
2  Afghanistan  AFG  1951                         91600.0
3  Afghanistan  AFG  1952                         91600.0
4  Afghanistan  AFG  1953                        106256.0

In [68]:

pd_em[pd_em['Year'] > 1900].groupby(by=["Entity"]).mean().sort_values(by=['Annual COâ‚‚ emissions (tonnes )'], ascending=False)

                                Year  Annual COâ‚‚ emissions (tonnes )
Entity
World                    1959.000000                    1.308054e+10
United States            1959.000000                    3.322341e+09
EU-28                    1959.000000                    2.746021e+09
China                    1959.500000                    1.725314e+09
Russia                   1988.000000                    1.704900e+09
...                              ...                             ...
Saint Helena             1998.184211                    9.113389e+03
Antarctic Fisheries      1997.000000                    7.328000e+03
Niue                     1993.500000                    5.657887e+03
Kyrgysztan               1975.000000                    0.000000e+00
Statistical differences  1959.000000                   -6.592564e+07

[233 rows x 2 columns]

In [69]:
pd_em['Year'].min()

1751